; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c7-s2-p1-a3)

(:domain logistics)

(:objects a0 a1 a2 - airplane
          c0 c1 c2 c3 c4 c5 c6 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 t9 - truck
          l0-0 l1-0 l2-0 l3-0 l4-0 l5-0 l6-0 - airport
          l0-1 l1-1 l2-1 l3-1 l4-1 l5-1 l6-1 - location
          p0 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l2-0 c2)
    (in-city  l2-1 c2)
    (in-city  l3-0 c3)
    (in-city  l3-1 c3)
    (in-city  l4-0 c4)
    (in-city  l4-1 c4)
    (in-city  l5-0 c5)
    (in-city  l5-1 c5)
    (in-city  l6-0 c6)
    (in-city  l6-1 c6)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-1)
    (at t3 l3-1)
    (at t4 l4-1)
    (at t5 l5-1)
    (at t6 l6-1)
    (at t7 l1-1)
    (at t8 l5-1)
    (at t9 l1-1)
    (at p0 l0-1)
    (at a0 l6-0)
    (at a1 l2-0)
    (at a2 l2-0)
)

(:goal
    (and
        (at p0 l4-1)
    )
)
)

; plan
1. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 1
2. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 1
3. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 1
4. (drive t5 l5-1 l5-0)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 0 of 1
5. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 0 of 1
6. (drive t8 l5-1 l5-0)
   deleted: (at t8 l5-1)
   added: (at t8 l5-0)
   goals met: 0 of 1
7. (fly a0 l6-0 l1-0)
   deleted: (at a0 l6-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
8. (fly a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 0 of 1
9. (fly a2 l2-0 l3-0)
   deleted: (at a2 l2-0)
   added: (at a2 l3-0)
   goals met: 0 of 1
10. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 1
11. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 1
12. (drive t4 l4-1 l4-0)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 1
13. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 0 of 1
14. (drive t6 l6-1 l6-0)
   deleted: (at t6 l6-1)
   added: (at t6 l6-0)
   goals met: 0 of 1
15. (drive t7 l1-0 l1-1)
   deleted: (at t7 l1-0)
   added: (at t7 l1-1)
   goals met: 0 of 1
16. (fly a2 l3-0 l0-0)
   deleted: (at a2 l3-0)
   added: (at a2 l0-0)
   goals met: 0 of 1
17. (load t0 p0 l0-1)
   deleted: (at p0 l0-1)
   added: (in p0 t0)
   goals met: 0 of 1
18. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 1
19. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 1
20. (drive t4 l4-0 l4-1)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 0 of 1
21. (drive t8 l5-0 l5-1)
   deleted: (at t8 l5-0)
   added: (at t8 l5-1)
   goals met: 0 of 1
22. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 1
23. (unload t0 p0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 0 of 1
24. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 1
25. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 1
26. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 1
27. (drive t4 l4-1 l4-0)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 1
28. (drive t8 l5-1 l5-0)
   deleted: (at t8 l5-1)
   added: (at t8 l5-0)
   goals met: 0 of 1
29. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 0 of 1
30. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
31. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 1
32. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 1
33. (drive t5 l5-1 l5-0)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 0 of 1
34. (drive t6 l6-0 l6-1)
   deleted: (at t6 l6-0)
   added: (at t6 l6-1)
   goals met: 0 of 1
35. (fly a1 l0-0 l5-0)
   deleted: (at a1 l0-0)
   added: (at a1 l5-0)
   goals met: 0 of 1
36. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 1
37. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 1
38. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 1
39. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 1
40. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 0 of 1
41. (drive t9 l1-1 l1-0)
   deleted: (at t9 l1-1)
   added: (at t9 l1-0)
   goals met: 0 of 1
42. (fly a1 l5-0 l2-0)
   deleted: (at a1 l5-0)
   added: (at a1 l2-0)
   goals met: 0 of 1
43. (fly a2 l0-0 l6-0)
   deleted: (at a2 l0-0)
   added: (at a2 l6-0)
   goals met: 0 of 1
44. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 1
45. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 1
46. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 1
47. (drive t6 l6-1 l6-0)
   deleted: (at t6 l6-1)
   added: (at t6 l6-0)
   goals met: 0 of 1
48. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 0 of 1
49. (drive t8 l5-0 l5-1)
   deleted: (at t8 l5-0)
   added: (at t8 l5-1)
   goals met: 0 of 1
50. (drive t9 l1-0 l1-1)
   deleted: (at t9 l1-0)
   added: (at t9 l1-1)
   goals met: 0 of 1
51. (fly a0 l1-0 l4-0)
   deleted: (at a0 l1-0)
   added: (at a0 l4-0)
   goals met: 0 of 1
52. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 0 of 1
53. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 1
54. (drive t7 l1-0 l1-1)
   deleted: (at t7 l1-0)
   added: (at t7 l1-1)
   goals met: 0 of 1
55. (drive t8 l5-1 l5-0)
   deleted: (at t8 l5-1)
   added: (at t8 l5-0)
   goals met: 0 of 1
56. (drive t9 l1-1 l1-0)
   deleted: (at t9 l1-1)
   added: (at t9 l1-0)
   goals met: 0 of 1
57. (unload a0 p0 l4-0)
   deleted: (in p0 a0)
   added: (at p0 l4-0)
   goals met: 0 of 1
58. (fly a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 0 of 1
59. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 1
60. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 0 of 1
61. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 1
62. (drive t5 l5-1 l5-0)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 0 of 1
63. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 0 of 1
64. (drive t9 l1-0 l1-1)
   deleted: (at t9 l1-0)
   added: (at t9 l1-1)
   goals met: 0 of 1
65. (fly a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 0 of 1
66. (fly a1 l2-0 l3-0)
   deleted: (at a1 l2-0)
   added: (at a1 l3-0)
   goals met: 0 of 1
67. (fly a2 l6-0 l3-0)
   deleted: (at a2 l6-0)
   added: (at a2 l3-0)
   goals met: 0 of 1
68. (load t4 p0 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 t4)
   goals met: 0 of 1
69. (drive t4 l4-0 l4-1)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 0 of 1
70. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 0 of 1
71. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 0 of 1
72. (fly a0 l2-0 l6-0)
   deleted: (at a0 l2-0)
   added: (at a0 l6-0)
   goals met: 0 of 1
73. (fly a2 l3-0 l4-0)
   deleted: (at a2 l3-0)
   added: (at a2 l4-0)
   goals met: 0 of 1
74. (unload t4 p0 l4-1)
   deleted: (in p0 t4)
   added: (at p0 l4-1)
   goals met: 1 of 1
